---
kind: enumMember
id: F:Autodesk.Revit.DB.VerticalTextAlignment.Top
enum: Autodesk.Revit.DB.VerticalTextAlignment
source: html/07fa4c42-fe8b-4005-9e1d-9d035da44c8c.htm
---
# Autodesk.Revit.DB.VerticalTextAlignment.Top

Top of the text box remains in place as the height of the text changes.